{
  "_name_or_path": "microsoft/BiomedNLP-BiomedBERT-base-uncased-abstract-fulltext",
  "architectures": [
    "BertForLabelAttendedSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Aggregate",
    "1": "Has Human Subjects",
    "2": "Has Target Disease",
    "3": "Cohort Study or Clinical Trial",
    "4": "Has Quantitative Outcome Measure",
    "5": "Has Study Drug(s)",
    "6": "Has Population Size",
    "7": "Has Comparator Group"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Aggregate": 0,
    "Cohort Study or Clinical Trial": 3,
    "Has Comparator Group": 7,
    "Has Human Subjects": 1,
    "Has Population Size": 6,
    "Has Quantitative Outcome Measure": 4,
    "Has Study Drug(s)": 5,
    "Has Target Disease": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.34.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
